//;******************************************************************************
//;* Copyright (c) 2015, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//; 

/=#

#include "Standard.uni"

// Form - Help Text Panel
#string STR_FORM_HELP_TEXT_PANEL_TITLE                                               #language en-US  "Help Text Panel"
#string STR_FORM_HELP_TEXT_PANEL_HELP                                                #language en-US  "Test the display of Help Text Panel"

// Question text string
#string STR_HELP_TEXT_PANEL_QUESTION_ONE_LINE_PROMPT                                 #language en-US  "Help text string with one line"
#string STR_HELP_TEXT_PANEL_QUESTION_ONE_LINE_HELP                                   #language en-US  "One line"
#string STR_HELP_TEXT_PANEL_QUESTION_MULTI_LINE_PROMPT                               #language en-US  "Help text string with multi lines"
#string STR_HELP_TEXT_PANEL_QUESTION_MULTI_LINE_HELP                                 #language en-US  "Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line Multi line "
#string STR_HELP_TEXT_PANEL_QUESTION_WITH_LINE_FEED_PROMPT                           #language en-US  "Help text string with line feed char"
#string STR_HELP_TEXT_PANEL_QUESTION_WITH_LINE_FEED_LINE_HELP                        #language en-US  "First line feed\nSecond line feed\n"
#string STR_HELP_TEXT_PANEL_QUESTION_TWO_PAGES_PROMPT                                #language en-US  "Help text string with two pages"
#string STR_HELP_TEXT_PANEL_QUESTION_TWO_PAGES_HELP                                  #language en-US  "Line1\nLine2\nLine3\nLine4\nLine5\nLine6\nLine7\nLine8\nLine9\nLine0\nLine1\nLine2\nLine3\nLine4\nLine5\nLine6\nLine7\nLine8\nLine9\nLine0\nLine1\nLine2\nLine3\nLine4\nLine5\nLine6\nLine7\nLine8\nLine9\nLine0\nLine1\nLine2\nLine3\nLine4\nLine5\nLine6\nLine7\nLine8\nLine9\nLine0\nLine1\nLine2\nLine3\nLine4\nLine5\nLine6\nLine7\nLine8\nLine9\nLine0\n"
#string STR_HELP_TEXT_PANEL_QUESTION_THREE_PAGES_PROMPT                              #language en-US  "Help text string with three pages"
#string STR_HELP_TEXT_PANEL_QUESTION_THREE_PAGES_HELP                                #language en-US  "11111111111111111111111111111111111111\n"
                                                                                                      "22222222222222222222222222222222222222\n"
                                                                                                      "33333333333333333333333333333333333333\n"
                                                                                                      "44444444444444444444444444444444444444\n"
                                                                                                      "55555555555555555555555555555555555555\n"
                                                                                                      "66666666666666666666666666666666666666\n"
                                                                                                      "77777777777777777777777777777777777777\n"
                                                                                                      "88888888888888888888888888888888888888\n"
                                                                                                      "99999999999999999999999999999999999999\n"
                                                                                                      "00000000000000000000000000000000000000\n"
                                                                                                      "11111111111111111111111111111111111111\n"
                                                                                                      "22222222222222222222222222222222222222\n"
                                                                                                      "33333333333333333333333333333333333333\n"
                                                                                                      "44444444444444444444444444444444444444\n"
                                                                                                      "55555555555555555555555555555555555555\n"
                                                                                                      "66666666666666666666666666666666666666\n"
                                                                                                      "77777777777777777777777777777777777777\n"
                                                                                                      "88888888888888888888888888888888888888\n"
                                                                                                      "99999999999999999999999999999999999999\n"
                                                                                                      "00000000000000000000000000000000000000\n"
                                                                                                      "11111111111111111111111111111111111111\n"
                                                                                                      "22222222222222222222222222222222222222\n"
                                                                                                      "33333333333333333333333333333333333333\n"
                                                                                                      "44444444444444444444444444444444444444\n"
                                                                                                      "55555555555555555555555555555555555555\n"
                                                                                                      "66666666666666666666666666666666666666\n"
                                                                                                      "77777777777777777777777777777777777777\n"
                                                                                                      "88888888888888888888888888888888888888\n"
                                                                                                      "99999999999999999999999999999999999999\n"
                                                                                                      "00000000000000000000000000000000000000\n"
                                                                                                      "11111111111111111111111111111111111111\n"
                                                                                                      "22222222222222222222222222222222222222\n"
                                                                                                      "33333333333333333333333333333333333333\n"
                                                                                                      "44444444444444444444444444444444444444\n"
                                                                                                      "55555555555555555555555555555555555555\n"
                                                                                                      "66666666666666666666666666666666666666\n"
                                                                                                      "77777777777777777777777777777777777777\n"
                                                                                                      "88888888888888888888888888888888888888\n"
                                                                                                      "99999999999999999999999999999999999999\n"
                                                                                                      "00000000000000000000000000000000000000\n"
                                                                                                      "11111111111111111111111111111111111111\n"
                                                                                                      "22222222222222222222222222222222222222\n"
                                                                                                      "33333333333333333333333333333333333333\n"
                                                                                                      "44444444444444444444444444444444444444\n"
                                                                                                      "55555555555555555555555555555555555555\n"
                                                                                                      "66666666666666666666666666666666666666\n"
                                                                                                      "77777777777777777777777777777777777777\n"
                                                                                                      "88888888888888888888888888888888888888\n"
                                                                                                      "99999999999999999999999999999999999999\n"
                                                                                                      "00000000000000000000000000000000000000\n"
                                                                                                      "11111111111111111111111111111111111111\n"
                                                                                                      "22222222222222222222222222222222222222\n"
                                                                                                      "33333333333333333333333333333333333333\n"
                                                                                                      "44444444444444444444444444444444444444\n"
                                                                                                      "55555555555555555555555555555555555555\n"
                                                                                                      "66666666666666666666666666666666666666\n"
                                                                                                      "77777777777777777777777777777777777777\n"
                                                                                                      "88888888888888888888888888888888888888\n"
                                                                                                      "99999999999999999999999999999999999999\n"
                                                                                                      "00000000000000000000000000000000000000\n"
                                                                                                      "11111111111111111111111111111111111111\n"
                                                                                                      "22222222222222222222222222222222222222\n"
                                                                                                      "33333333333333333333333333333333333333\n"
                                                                                                      "44444444444444444444444444444444444444\n"
                                                                                                      "55555555555555555555555555555555555555\n"
                                                                                                      "66666666666666666666666666666666666666\n"
                                                                                                      "77777777777777777777777777777777777777\n"
                                                                                                      "88888888888888888888888888888888888888\n"
                                                                                                      "99999999999999999999999999999999999999\n"
                                                                                                      "00000000000000000000000000000000000000\n"